# Задача №7 Целочисленное деление.
print('Введите первое число: ')
a = int(input())
print('Введите второе число: ')
b = int(input())

c = a % b + b

print(c)
